Autodesk.Revit.DB.RoutingPreferenceManager.GetSharedSizes(System.Double,Autodesk.Revit.DB.ConnectorProfileType)
Gets a list of all segments of a given profile shape that define a given size.
size:
The size to search for.
shape:
The profile shape of segment object.
Returns:
A list of all segments that define a given size.
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
A value passed for an enumeration argument is not a member of that enumeration
Since:
2013

Autodesk.Revit.DB.RoutingPreferenceManager.GetMEPPartId(Autodesk.Revit.DB.RoutingPreferenceRuleGroupType,Autodesk.Revit.DB.RoutingConditions)
Gets a fitting or segment id of given routing preference group that meets the specified routing conditions.
groupType:
The routing preference group
conditions:
A set of routing conditions
Returns:
The Id of the fitting or segment that met the given routing conditions.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
A value passed for an enumeration argument is not a member of that enumeration
Since:
2013

Autodesk.Revit.DB.RoutingPreferenceManager.RemoveRule(Autodesk.Revit.DB.RoutingPreferenceRuleGroupType,System.Int32)
Removes an existing routing preference rule.
Thrown if the index is out of bounds.
groupType:
The routing preference group type in which the rule should be removed.
index:
The index position of removed routing preference rule in the group.
Throws Autodesk.Revit.Exceptions.ArgumentException:
index is not a valid zero-based index within groupType.
-or-
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
A value passed for an enumeration argument is not a member of that enumeration
Throws Autodesk.Revit.Exceptions.DisabledDisciplineException:
None of the following disciplines is enabled: Mechanical Electrical Piping.
Since:
2013

Autodesk.Revit.DB.RoutingPreferenceManager.AddRule(Autodesk.Revit.DB.RoutingPreferenceRuleGroupType,Autodesk.Revit.DB.RoutingPreferenceRule,System.Int32)
Adds a new routing preference rule to the specified position in the rule group.
groupType:
The routing preference group type in which the rule should be added.
rule:
The new rule to be added.
index:
The zero-based index position where the new rule will be added.
Throws Autodesk.Revit.Exceptions.ArgumentException:
index is not a valid zero-based index within groupType.
-or-
The rule cannot be added to the groupType.
-or-
Thrown if the index is out of bounds, or the rule is not valid for this group (e.g. an elbow may not be added to the junction group).
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
A value passed for an enumeration argument is not a member of that enumeration
Throws Autodesk.Revit.Exceptions.DisabledDisciplineException:
None of the following disciplines is enabled: Mechanical Electrical Piping.
Since:
2013

Autodesk.Revit.DB.RoutingPreferenceManager.AddRule(Autodesk.Revit.DB.RoutingPreferenceRuleGroupType,Autodesk.Revit.DB.RoutingPreferenceRule)
Adds a new routing preference rule to the rule group.
groupType:
The routing preference group in which the rule should be added.
rule:
The new rule to be added.
Throws Autodesk.Revit.Exceptions.ArgumentException:
The rule cannot be added to the groupType.
-or-
Thrown if the index is out of bounds, or the rule is not valid for this group (e.g. an elbow may not be added to the junction group).
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
A value passed for an enumeration argument is not a member of that enumeration
Throws Autodesk.Revit.Exceptions.DisabledDisciplineException:
None of the following disciplines is enabled: Mechanical Electrical Piping.
Since:
2013

Autodesk.Revit.DB.RoutingPreferenceManager.GetRule(Autodesk.Revit.DB.RoutingPreferenceRuleGroupType,System.Int32)
Gets the specified rule.
groupType:
The routing preference group type from which the rule should be returned.
index:
The zero-based index where the rule should be returned.
Returns:
The rule at the specified group and zero-based index position.
Throws Autodesk.Revit.Exceptions.ArgumentException:
index is not a valid zero-based index within groupType.
-or-
Thrown if the index is out of bounds
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
A value passed for an enumeration argument is not a member of that enumeration
Since:
2013

Autodesk.Revit.DB.RoutingPreferenceManager.GetNumberOfRules(Autodesk.Revit.DB.RoutingPreferenceRuleGroupType)
The number of RoutingPreference rules in a group.
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
A value passed for an enumeration argument is not a member of that enumeration
Since:
2013

Autodesk.Revit.DB.RoutingPreferenceManager.IsValidObject
Specifies whether the .NET object represents a valid Revit entity.
Remarks:
If the corresponding Revit native object is destroyed, or creation of the corresponding object is undone,
a managed API object containing it is no longer valid. API methods cannot be called on invalidated wrapper objects.
Returns:
True if the API object holds a valid Revit native object, false otherwise.
Since:
2014

Autodesk.Revit.DB.RoutingPreferenceManager.OwnerId
The Id of the MEPCurveType that owns the RoutingPreferenceManager
Since:
2013

Autodesk.Revit.DB.RoutingPreferenceManager.PreferredJunctionType
The preferred junction type.
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
When setting this property: A value passed for an enumeration argument is not a member of that enumeration
Throws Autodesk.Revit.Exceptions.DisabledDisciplineException:
When setting this property: None of the following disciplines is enabled: Mechanical Electrical Piping.
Since:
2013

Autodesk.Revit.DB.RoutingPreferenceManager
Manages default pipe segments, fittings, and selection criteria for a given MEPCurveType
Remarks:
MEPCurveTypes contain a RoutingPreferenceManager property.
The RoutingPreferenceManager contains rules for selecting segment types and sizes as well as fitting types based on user selection criteria.
Since:
2013